/*计算二元一次方程的根，含有复根*/  
#include<stdio.h>
#include<math.h>
int main()
{
	float a,b,c,d,e,g,q,x1,x2;/*所需数据*/ 
	scanf("%f %f %f",&a,&b,&c);/*输入二元一次方程的系数啊，a,b,c*/ 
	d=(b*b-4*a*c);/*计算d*/ 
	if(d>=0)/*判断d的正负，确定的的值，从而确定有实根还是复根*/ 
	{
		q=sqrt(d);/*根号d，方便带入计算*/ 
		x1=(-b+q)/(2*a);
		x2=(-b-q)/(2*a);/*求解两个根x1,x2*/ 
		printf("d=%.2f,a=%.2f,b=%.2f,q=%.2f,c=%.2f,x1=%.2f,x2=%.2f\n",x1,x2);/*输出两实根*/
	}
	else/*d是负数，计算复根*/ 
	{
		e=-b/(2*a);/*先计算实数部分*/ 
		g=(sqrt(-d))/(2*a);/*-d为正数，开根号*/ 
		printf("a=%.2f,b=%.2f,e=%.2f,g=%.2f,x1=%.2f+%.2fi\n",e,g);/*i是虚数单位，表示虚数部分*/ 
		printf("a=%.2f,b=%.2f,e=%.2f,g=%.2f,x2=%.2f-%.2fi\n",e,g);/*输出两个复根*/ 
	}
}


